---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CoverTooLong
source: html/0d2d2556-8387-be0a-028d-e102ec43377c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CoverTooLong Property

Rebar Cover length is too large for host thickness.

## Syntax (C#)
```csharp
public static FailureDefinitionId CoverTooLong { get; }
```